# # -*- coding:utf-8 -*-
# # @Time :2019/12/6 17:16
# # @Author   :testcode_susu
# # @Email    :2804555260@qq.com
# # @File :class_03_task.py

# 1、定义一个列表[1, 2, 3]，并将列表中的头尾两个元素对调。对调后为[3, 2, 1]

# 2、定义一个列表，并将列表中的指定位置的两个元素对调。对调第一个和第三个元素
# 列表如下：[23, 65, 19, 90]
# 对调后结果：[19, 65, 23, 90]

# 3、对列表[10, 11, 12, 13, 14, 15]
# 翻转，调整后为[15, 14, 13, 12, 11, 10]

# 4、判定6是否包含列表[1, 6, 3, 5, 3, 4]

# 5、[1, 6, 3, 5, 3, 4]
# 转换为元组

# 6、根据列表[1, 6, 3, 5, 3, 4]
# 作为新字典的key, 对应key的初始值为0，并打印新字典对象

# 7、循环打印出字典
# {'name': 'aming', 'age': 18, 'school': 'cema'}
# 中的所有键和值，

# 8、{‘taobao’, 'jingdong', 'alibaba', 'baidu', 'taobao'}对元素去重复  （不做）

# 9、分别有两个集合
# {1, 2, 1, 3, 4, 5, 6, 7}，{1, 2, 3, 8, 9, 7, 10}，求两个集合的差集、并集、交集（不做）

# 10、判断8题中两个集合如果存在相同运算，则打印重复，否则打印无重复

# 11、list7 = [1, 2, 3, 4, 5]
# 根据列表中的元素作为字典中的key, 及初始值为0，打印这个新的字典，不用fromkey方法实现
